RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_clc_regs.h
/* Bitfield definition for register of struct array VDVQ_CHAN: P2Z2_PRE0 */
/*
 * 2P2Z_PRE0 (RW)
 *
 * 2p2z previous 0 value
 */
#define CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_SHIFT (0U)
#define CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_SHIFT) & CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_MASK)
#define CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_MASK) >> CLC_VDVQ_CHAN_P2Z2_PRE0_2P2Z_PRE0_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: P3Z3_CURR */
/*
 * 3P3Z_CURR (RW)
 *
 * 3p3z latest value
 */
#define CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_SHIFT (0U)
#define CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_SHIFT) & CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_MASK)
#define CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_MASK) >> CLC_VDVQ_CHAN_P3Z3_CURR_3P3Z_CURR_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: P3Z3_FORBID_LO */
/*
 * 3P3Z_FORBID_LO (RW)
 *
 * 3p3z output forbid low threshold
 */
#define CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_SHIFT (0U)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_SHIFT) & CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_MASK)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_MASK) >> CLC_VDVQ_CHAN_P3Z3_FORBID_LO_3P3Z_FORBID_LO_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: P3Z3_FORBID_MD */
/*
 * 3P3Z_FORBID_MD (RW)
 *
 * 3p3z output forbid middle threshold
 */
#define CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_SHIFT (0U)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_SHIFT) & CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_MASK)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_MASK) >> CLC_VDVQ_CHAN_P3Z3_FORBID_MD_3P3Z_FORBID_MD_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: P3Z3_FORBID_HI */
/*
 * 3P3Z_FORBID_HI (RW)
 *
 * 3p3z output forbid high threshold
 */
#define CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_SHIFT (0U)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_SHIFT) & CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_MASK)
#define CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_MASK) >> CLC_VDVQ_CHAN_P3Z3_FORBID_HI_3P3Z_FORBID_HI_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: ADC_SW */
/*
 * ADC_SW (RW)
 *
 * adc software inject value
 */
#define CLC_VDVQ_CHAN_ADC_SW_ADC_SW_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_ADC_SW_ADC_SW_SHIFT (0U)
#define CLC_VDVQ_CHAN_ADC_SW_ADC_SW_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_ADC_SW_ADC_SW_SHIFT) & CLC_VDVQ_CHAN_ADC_SW_ADC_SW_MASK)
#define CLC_VDVQ_CHAN_ADC_SW_ADC_SW_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_ADC_SW_ADC_SW_MASK) >> CLC_VDVQ_CHAN_ADC_SW_ADC_SW_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: STATUS */
/*
 * STATUS (W1C)
 *
 * status, write 1 to clear it. :
 * irq_data_in_forbid     , // 10
 * irq_forb_err_boundary  , // 9
 * irq_p3z3_over_lo       , // 8
 * irq_p3z3_over_hi       , // 7
 * irq_p3z3_err_boundary  , // 6
 * irq_z2_over_sf         , // 5
 * irq_z2_over_lo         , // 4
 * irq_z2_over_hi         , // 3
 * irq_z2_err_boundary    , // 2
 * irq_coef_err_boundary  , // 1
 * irq_valid_clc            // 0
 */
#define CLC_VDVQ_CHAN_STATUS_STATUS_MASK (0x7FFU)
#define CLC_VDVQ_CHAN_STATUS_STATUS_SHIFT (0U)
#define CLC_VDVQ_CHAN_STATUS_STATUS_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_STATUS_STATUS_SHIFT) & CLC_VDVQ_CHAN_STATUS_STATUS_MASK)
#define CLC_VDVQ_CHAN_STATUS_STATUS_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_STATUS_STATUS_MASK) >> CLC_VDVQ_CHAN_STATUS_STATUS_SHIFT)

/* Bitfield definition for register: DQ_ADC_SW_READY */
/*
 * DQ_ADC_SW_READY (W1C)
 *
 * enable d/q chan software inject adc value
 */
#define CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_MASK (0x1U)
#define CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_SHIFT (0U)
#define CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_SET(x) (((uint32_t)(x) << CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_SHIFT) & CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_MASK)
#define CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_GET(x) (((uint32_t)(x) & CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_MASK) >> CLC_DQ_ADC_SW_READY_DQ_ADC_SW_READY_SHIFT)



/* COEFF register group index macro definition */
#define CLC_COEFF_0 (0UL)
#define CLC_COEFF_1 (1UL)
#define CLC_COEFF_2 (2UL)

/* VDVQ_CHAN register group index macro definition */
#define CLC_VDVQ_CHAN_VD (0UL)
#define CLC_VDVQ_CHAN_VQ (1UL)


#endif /* HPM_CLC_H */
